# 决策树
#	用SNS社区中不真实招呼检测的例子说明如何使用ID3算法构建决策树，为了简单
# 起见，我们假设训练集合包中包含10个元素，其中s、m和l分别表示小、中、大。

##	测试集	##
# 日志密度
a <- c("s" , "s" , "l" , "m" , "l" , "m" , "m" , "l" , "m" , "s"  )

#	好友密度
a <- c("s" , "l" , "m" , "m" , "m" , "l" , "s" , "m" , "s" , "s" )

#	是否使用真实头像
a <- c("n" , "y" , "y" , "y" , "y" , "n" , "n" , "n" , "n" , "y" )

#	账号是否真实
a <- c("n" , "y" , "y" , "y" , "y" , "y" , "n" , "y" , "y" , "n" )

##	信息增益	##
#	整个问题的信息增益
infoD=-0.7*log(0.7 , 2) - 0.3*log(0.3 , 2)
#↑由于账号是否真实这个结果可以看出有两种分类，真实/不真实
#↑故以2为底。其次真实的占十分之七，不真实占十分之三。

# 日志密度的信息增益
infoDL=0.3*(-(0/3)*log((0/3) , 2) - (3/3)*log((3/3) , 2)) + 0.4*(-(1/4)*log((1/4) , 2) - (3/4)*log((3/4) , 2)) +0.3*(-(1/3)*log((1/3) , 2) - (2/3)*log((2/3) , 2))
#↑分为三部分
#↑讲解第一部分 0.3*(-(0/3)*log((0/3) , 2) - (3/3)*log((3/3) , 2))
#↑在日志密度中，"l"占有十分之三，其中不真实中包含三分之0个，真实的占三分之一个。

#	信息增益
gainL = infoD - infoDL #0.276

###	说明
#	因此日志的信息增益是0.276。用同样方法得到其他两种的信息增益分别是0.033和
#	0.553。因为F具有最大的信息增益，所以第一次分裂选择F为分裂属性。