#P273页案例
#背景：例6.9：某大型牙膏制造企业为了更好地拓展产品市场、有效地管理库存，公司董事
#会要求销售部门根据市场调查，找出公司生产的牙膏销售量与销售价格、广告投入等之间
#的关系，从而预测出在不同价格与广告费用下的销售量。为此，销售部门的研究人员收集了
#过去30个销售周期（每个销售周期为4周）公司生产的牙膏的销售量、销售价格、投入
#的广告费用，以及周期内其他厂商生产同类牙膏的市场平均销售价格，如表6.4所示。试
#根据这些数据建立一个数据模型，分析牙膏销售量与其他因素的关系，为制定价格策略和
#广告投入策略提供数据依据。

#***以下是基本数据***#
x01=c(3.85,3.75,3.70,3.70,3.60,3.60,3.60,3.80,3.80,3.85,3.90,3.90,3.70,3.75,3.75,3.80,3.70,3.80,3.70,3.80,3.80,3.75,3.70,3.55,3.60,3.65,3.70,3.75,3.80,3.70)
	#↑公司销售价格/元

x02=c(3.80,4.00,4.30,3.70,3.85,3.80,3.75,3.85,3.65,4.00,4.10,4.00,4.10,4.20,4.10,4.10,4.20,4.30,4.10,3.75,3.75,3.65,3.90,3.65,4.10,4.25,3.65,3.75,3.85,4.25)
	#↑其他厂商平均价格/元

x03=c(-0.05,0.25,0.60,0.00,0.25,0.20,0.15,0.05,-0.15,0.15,0.20,0.10,0.40,0.45,0.35,0.30,0.50,0.50,0.40,-0.05,-0.05,-0.10,0.20,0.10,0.50,0.60,-0.05,0.00,0.05,0.55)
	#↑价格差(x02-x01)/元

x04=c(5.50,6.75,7.25,5.50,7.00,6.50,6.75,5.25,5.25,6.00,6.50,6.25,7.00,6.90,6.80,6.80,7.10,7.00,6.80,6.50,6.25,6.00,6.50,7.00,6.80,6.80,6.50,5.75,5.80,6.80)
	#↑广告费/百万元

y01=c(7.38,8.51,9.52,7.50,9.33,8.28,8.75,7.87,7.10,8.00,7.89,8.15,9.10,8.86,8.90,8.87,9.26,9.00,8.75,7.95,7.65,7.27,8.00,8.50,8.75,9.21,8.27,7.67,7.93,9.26)
	#↑销售量/百万元

toothpaste<-data.frame(
		x1=x03,
		x2=x04,
		y=y01
		)
	#↑创建数据集

lm.sol<-lm(y~x1+x2,data=toothpaste)
	#↑创建回归方程 y=A*x1+B*x2+C的形式

#summary(lm.sol)
	#↑输出回归方程内容


#***以下是优化回归方程***#
#***以下是绘制x1和y的散点图和回归方程***#
attach(toothpaste)
	#↑Description(attach):查看可用变量
	#↑The database is attached to the R search path. This means that the database is searched by R when evaluating a variable, so objects in the database can be accessed by simply giving their names.
#plot(y~x1);abline(lm(y~x1))
	#↑绘制散点图和回归曲线

#***以下是绘制x2和y的散点图和回归方程***#
lm2.sol<-lm(y~x2+I(x2^2))
	#↑绘制散点图和回归曲线,未指定数据data=toothpaste
X<-seq(min(x2),max(x2),len=200)
	#↑特殊方法取值，将x2分为200份
	#↑此处为大写X
Y<-predict(lm2.sol,data.frame(x2=X))
	#↑此处为大写Y
plot(y~x2)
lines(X,Y)


























#遗留问题：为什么不等？
#for(i in 1:30)if((x02[i]-x01[i])==x03[i])print(paste(as.character(x02[i]-x01[i]),as.character(x03[i]),sep="==")) else print((paste(as.character(x02[i]-x01[i]),as.character(x03[i]),sep="!=")))

