#P292
#某公司为研究产品的销售策略，对产品的销售状况进行了调查，设Y为
#某地区该产品的家庭人均购买量（单位：元），X为家庭人均收入（单位：元）
#是通过这些数据建立Y与X的关系式。

Y=c(
0.79,0.44,0.56,0.79,2.70,3.64,4.73,9.50,5.34,6.85,
5.84,5.21,3.25,4.43,3.16,0.50,0.17,1.88,0.77,1.39,
0.56,1.56,5.28,0.64,4.00,0.31,4.20,4.88,3.48,7.58,
2.63,4.99,0.59,8.19,4.79,0.51,1.74,4.10,3.94,0.96,
3.29,0.44,3.24,2.14,5.71,0.64,1.90,0.51,8.33,14.94,
5.11,3.84,3.93
)
	#↑输入Y的值，某地区该产品的家庭人均购买量（单位：元）

X=c(
679,292,1012,493,582,1156,997,2189,1097,2078,
1818,1700,747,2030,1643,414,354,1276,745,435,
540,874,1543,1029,710,1434,837,1748,1381,1428,
1255,1777,370,2316,1130,463,770,724,808,790,
783,406,1242,658,1746,468,1114,413,1787,3560,
1495,2221,1526
)

lm.sol=lm(Y~X)
	#↑建立线性关系模型
summary(lm.sol)
	#↑输出关系模型的值
	#Y=-0.830940+0.003682X
y.rst<-rstandard(lm.sol)
	#↑标准化残差
y.fit<-predict(lm.sol)
	#↑预测值
plot(y.rst~y.fit)
	#↑绘制残差-预测值关系图
abline(0.1,0.5)
abline(-0.1,-0.5)
	#↑辅助趋势线

###***修改模型***###
lm.new<-update(lm.sol,sqrt(.)~.);
	#↑更新回归模型语句
yn.rst=rstandard(lm.new)
yn.fit=predict(lm.new)
plot(yn.rst~yn.fit)